; domain
(define (domain zenotravel)
	(:requirements :typing :negative-preconditions)
	(:types
		Time - Object
		City - Object
		Aircraft - Thing
		Person - Thing
		Thing - Object
		FLevel - Object
	)
	(:predicates
		(at ?arg0 - Thing ?arg1 - City)
		(in ?arg0 - Person ?arg1 - Aircraft)
		(next ?arg0 - FLevel ?arg1 - FLevel)
		(max ?arg0 - FLevel)
        (min ?arg0 - FLevel)
        (not-min ?arg0 - FLevel)
		(fuel-level ?arg0 - Aircraft ?arg1 - FLevel)
	)
	(:action board
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(at ?p ?c)
                (at ?a ?c)
			)
		:effect
			(and
				(not (at ?p ?c))
				(in ?p ?a)
			)
	)

	(:action debark
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(in ?p ?a)
                (at ?a ?c)
			)
		:effect
			(and
				(not (in ?p ?a))
				(at ?p ?c)
			)
	)

	(:action refuel
		:parameters (?a - Aircraft ?l - FLevel ?l1 - FLevel)
		:precondition
			(and
				(fuel-level ?a ?l)
			)
		:effect
			(and
				(not (fuel-level ?a ?l))
				(fuel-level ?a ?l1)
			)
	)

	(:action fly
		:parameters (?a - Aircraft ?c1 - City ?c2 - City ?l1 - FLevel ?l2 - FLevel)
		:precondition
			(and
				(at ?a ?c1)
				(fuel-level ?a ?l1)
                (next ?l2 ?l1)
			)
		:effect
			(and
				(not (at ?a ?c1))
				(at ?a ?c2)
				(not (fuel-level ?a ?l1))
				(fuel-level ?a ?l2)
			)
	)
)

; problem
(define (problem p6)
(:domain zenotravel)
(:objects
 f0 f1 f2 - FLevel
 a1 a2 - Aircraft
 c1 c2 c3 - City
 p1 p2 p3 p4 p5 p6 p7 p8 p9 - Person
)
(:init
(min f0) (max f2)
(next f0 f1)
(not-min f1)
(next f1 f2)
(not-min f2)
(fuel-level a1 f2) (at a1 c1)
(fuel-level a2 f2) (at a2 c2)
(at p1 c2)
(at p2 c2)
(at p3 c2)
(at p4 c3)
(at p5 c3)
(at p6 c1)
(at p7 c1)
(at p8 c3)
(at p9 c2)
)
(:goal (and
(at a1 c1)
(at a2 c2)
(at p1 c3)
(at p2 c1)
(at p3 c1)
(at p4 c1)
(at p5 c2)
(at p6 c1)
(at p7 c2)
(at p8 c2)
(at p9 c3)
))
)

; plan
1. (board p1 a2 c2)
   deleted: (at p1 c2)
   added: (in p1 a2)
   goals met: 3 of 11
2. (fly a2 c2 c3 f2 f1)
   deleted: (at a2 c2) (fuel-level a2 f2)
   added: (at a2 c3) (fuel-level a2 f1)
   goals met: 2 of 11
3. (debark p1 a2 c3)
   deleted: (in p1 a2)
   added: (at p1 c3)
   goals met: 3 of 11
4. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 2 of 11
5. (board p2 a1 c2)
   deleted: (at p2 c2)
   added: (in p2 a1)
   goals met: 2 of 11
6. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 3 of 11
7. (debark p2 a1 c1)
   deleted: (in p2 a1)
   added: (at p2 c1)
   goals met: 4 of 11
8. (fly a2 c3 c2 f1 f0)
   deleted: (at a2 c3) (fuel-level a2 f1)
   added: (at a2 c2) (fuel-level a2 f0)
   goals met: 5 of 11
9. (board p3 a2 c2)
   deleted: (at p3 c2)
   added: (in p3 a2)
   goals met: 5 of 11
10. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 5 of 11
11. (fly a2 c2 c1 f2 f1)
   deleted: (at a2 c2) (fuel-level a2 f2)
   added: (at a2 c1) (fuel-level a2 f1)
   goals met: 4 of 11
12. (debark p3 a2 c1)
   deleted: (in p3 a2)
   added: (at p3 c1)
   goals met: 5 of 11
13. (fly a2 c1 c3 f1 f0)
   deleted: (at a2 c1) (fuel-level a2 f1)
   added: (at a2 c3) (fuel-level a2 f0)
   goals met: 5 of 11
14. (board p4 a2 c3)
   deleted: (at p4 c3)
   added: (in p4 a2)
   goals met: 5 of 11
15. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 5 of 11
16. (fly a2 c3 c1 f2 f1)
   deleted: (at a2 c3) (fuel-level a2 f2)
   added: (at a2 c1) (fuel-level a2 f1)
   goals met: 5 of 11
17. (debark p4 a2 c1)
   deleted: (in p4 a2)
   added: (at p4 c1)
   goals met: 6 of 11
18. (fly a2 c1 c3 f1 f0)
   deleted: (at a2 c1) (fuel-level a2 f1)
   added: (at a2 c3) (fuel-level a2 f0)
   goals met: 6 of 11
19. (board p5 a2 c3)
   deleted: (at p5 c3)
   added: (in p5 a2)
   goals met: 6 of 11
20. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 6 of 11
21. (fly a2 c3 c2 f2 f1)
   deleted: (at a2 c3) (fuel-level a2 f2)
   added: (at a2 c2) (fuel-level a2 f1)
   goals met: 7 of 11
22. (debark p5 a2 c2)
   deleted: (in p5 a2)
   added: (at p5 c2)
   goals met: 8 of 11
23. (board p7 a1 c1)
   deleted: (at p7 c1)
   added: (in p7 a1)
   goals met: 8 of 11
24. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 8 of 11
25. (fly a1 c1 c2 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 7 of 11
26. (debark p7 a1 c2)
   deleted: (in p7 a1)
   added: (at p7 c2)
   goals met: 8 of 11
27. (fly a1 c2 c3 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c3) (fuel-level a1 f0)
   goals met: 8 of 11
28. (board p8 a1 c3)
   deleted: (at p8 c3)
   added: (in p8 a1)
   goals met: 8 of 11
29. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 8 of 11
30. (fly a1 c3 c2 f2 f1)
   deleted: (at a1 c3) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 8 of 11
31. (debark p8 a1 c2)
   deleted: (in p8 a1)
   added: (at p8 c2)
   goals met: 9 of 11
32. (board p9 a1 c2)
   deleted: (at p9 c2)
   added: (in p9 a1)
   goals met: 9 of 11
33. (fly a1 c2 c3 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c3) (fuel-level a1 f0)
   goals met: 9 of 11
34. (debark p9 a1 c3)
   deleted: (in p9 a1)
   added: (at p9 c3)
   goals met: 10 of 11
35. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 10 of 11
36. (fly a1 c3 c1 f2 f1)
   deleted: (at a1 c3) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 11 of 11
